7767517
150 170
Input                    images                   0 1 images
Convolution              Conv_0                   1 1 images 359 0=32 1=3 3=2 4=1 5=1 6=864
Swish                    Mul_2                    1 1 359 361
ConvolutionDepthWise     Conv_3                   1 1 361 366 0=32 1=3 4=1 5=1 6=288 7=32 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_7                   1 1 366 724 0=16 1=1 5=1 6=512
Convolution              Conv_8                   1 1 724 373 0=96 1=1 5=1 6=1536 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_12                  1 1 373 378 0=96 1=3 3=2 4=1 5=1 6=864 7=96 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_16                  1 1 378 733 0=24 1=1 5=1 6=2304
Split                    splitncnn_0              1 2 733 733_splitncnn_0 733_splitncnn_1
Convolution              Conv_17                  1 1 733_splitncnn_1 385 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_21                  1 1 385 390 0=144 1=3 4=1 5=1 6=1296 7=144 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_25                  1 1 390 742 0=24 1=1 5=1 6=3456
BinaryOp                 Add_26                   2 1 733_splitncnn_0 742 393
Convolution              Conv_27                  1 1 393 398 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_31                  1 1 398 403 0=144 1=3 3=2 4=1 5=1 6=1296 7=144 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_35                  1 1 403 751 0=32 1=1 5=1 6=4608
Split                    splitncnn_1              1 2 751 751_splitncnn_0 751_splitncnn_1
Convolution              Conv_36                  1 1 751_splitncnn_1 410 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_40                  1 1 410 415 0=192 1=3 4=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_44                  1 1 415 760 0=32 1=1 5=1 6=6144
BinaryOp                 Add_45                   2 1 751_splitncnn_0 760 418
Split                    splitncnn_2              1 2 418 418_splitncnn_0 418_splitncnn_1
Convolution              Conv_46                  1 1 418_splitncnn_1 423 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_50                  1 1 423 428 0=192 1=3 4=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_54                  1 1 428 769 0=32 1=1 5=1 6=6144
BinaryOp                 Add_55                   2 1 418_splitncnn_0 769 431
Split                    splitncnn_3              1 2 431 431_splitncnn_0 431_splitncnn_1
Convolution              Conv_56                  1 1 431_splitncnn_1 436 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_60                  1 1 436 441 0=192 1=3 3=2 4=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_64                  1 1 441 778 0=64 1=1 5=1 6=12288
Split                    splitncnn_4              1 2 778 778_splitncnn_0 778_splitncnn_1
Convolution              Conv_65                  1 1 778_splitncnn_1 448 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_69                  1 1 448 453 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_73                  1 1 453 787 0=64 1=1 5=1 6=24576
BinaryOp                 Add_74                   2 1 778_splitncnn_0 787 456
Split                    splitncnn_5              1 2 456 456_splitncnn_0 456_splitncnn_1
Convolution              Conv_75                  1 1 456_splitncnn_1 461 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_79                  1 1 461 466 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_83                  1 1 466 796 0=64 1=1 5=1 6=24576
BinaryOp                 Add_84                   2 1 456_splitncnn_0 796 469
Split                    splitncnn_6              1 2 469 469_splitncnn_0 469_splitncnn_1
Convolution              Conv_85                  1 1 469_splitncnn_1 474 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_89                  1 1 474 479 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_93                  1 1 479 805 0=64 1=1 5=1 6=24576
BinaryOp                 Add_94                   2 1 469_splitncnn_0 805 482
Split                    splitncnn_7              1 2 482 482_splitncnn_0 482_splitncnn_1
Convolution              Conv_95                  1 1 482_splitncnn_1 487 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_99                  1 1 487 492 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_103                 1 1 492 814 0=96 1=1 5=1 6=36864
Split                    splitncnn_8              1 2 814 814_splitncnn_0 814_splitncnn_1
Convolution              Conv_104                 1 1 814_splitncnn_1 499 0=576 1=1 5=1 6=55296 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_108                 1 1 499 504 0=576 1=3 4=1 5=1 6=5184 7=576 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_112                 1 1 504 823 0=96 1=1 5=1 6=55296
BinaryOp                 Add_113                  2 1 814_splitncnn_0 823 507
Split                    splitncnn_9              1 2 507 507_splitncnn_0 507_splitncnn_1
Convolution              Conv_114                 1 1 507_splitncnn_1 512 0=576 1=1 5=1 6=55296 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_118                 1 1 512 517 0=576 1=3 4=1 5=1 6=5184 7=576 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_122                 1 1 517 832 0=96 1=1 5=1 6=55296
BinaryOp                 Add_123                  2 1 507_splitncnn_0 832 520
Split                    splitncnn_10             1 2 520 520_splitncnn_0 520_splitncnn_1
Convolution              Conv_124                 1 1 520_splitncnn_1 525 0=576 1=1 5=1 6=55296 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_128                 1 1 525 530 0=576 1=3 3=2 4=1 5=1 6=5184 7=576 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_132                 1 1 530 841 0=160 1=1 5=1 6=92160
Split                    splitncnn_11             1 2 841 841_splitncnn_0 841_splitncnn_1
Convolution              Conv_133                 1 1 841_splitncnn_1 537 0=960 1=1 5=1 6=153600 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_137                 1 1 537 542 0=960 1=3 4=1 5=1 6=8640 7=960 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_141                 1 1 542 850 0=160 1=1 5=1 6=153600
BinaryOp                 Add_142                  2 1 841_splitncnn_0 850 545
Split                    splitncnn_12             1 2 545 545_splitncnn_0 545_splitncnn_1
Convolution              Conv_143                 1 1 545_splitncnn_1 550 0=960 1=1 5=1 6=153600 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_147                 1 1 550 555 0=960 1=3 4=1 5=1 6=8640 7=960 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_151                 1 1 555 859 0=160 1=1 5=1 6=153600
BinaryOp                 Add_152                  2 1 545_splitncnn_0 859 558
Convolution              Conv_153                 1 1 558 563 0=960 1=1 5=1 6=153600 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_157                 1 1 563 568 0=960 1=3 4=1 5=1 6=8640 7=960 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_161                 1 1 568 868 0=320 1=1 5=1 6=307200
Convolution              Conv_162                 1 1 868 571 0=256 1=1 5=1 6=81920
Swish                    Mul_164                  1 1 571 573
Split                    splitncnn_13             1 2 573 573_splitncnn_0 573_splitncnn_1
Interp                   Resize_166               1 1 573_splitncnn_1 578 0=1 1=2.000000e+00 2=2.000000e+00
Concat                   Concat_167               2 1 578 482_splitncnn_0 579
Split                    splitncnn_14             1 2 579 579_splitncnn_0 579_splitncnn_1
Convolution              Conv_168                 1 1 579_splitncnn_1 580 0=128 1=1 5=1 6=40960
Swish                    Mul_170                  1 1 580 582
Convolution              Conv_171                 1 1 582 583 0=128 1=1 5=1 6=16384
Swish                    Mul_173                  1 1 583 585
Convolution              Conv_174                 1 1 585 586 0=128 1=3 4=1 5=1 6=147456
Swish                    Mul_176                  1 1 586 588
Convolution              Conv_177                 1 1 579_splitncnn_0 589 0=128 1=1 5=1 6=40960
Swish                    Mul_179                  1 1 589 591
Concat                   Concat_180               2 1 588 591 592
Convolution              Conv_181                 1 1 592 593 0=256 1=1 5=1 6=65536
Swish                    Mul_183                  1 1 593 595
Convolution              Conv_184                 1 1 595 596 0=128 1=1 5=1 6=32768
Swish                    Mul_186                  1 1 596 598
Interp                   Resize_188               1 1 598 603 0=1 1=2.000000e+00 2=2.000000e+00
Concat                   Concat_189               2 1 603 431_splitncnn_0 604
Split                    splitncnn_15             1 2 604 604_splitncnn_0 604_splitncnn_1
Convolution              Conv_190                 1 1 604_splitncnn_1 605 0=64 1=1 5=1 6=10240
Swish                    Mul_192                  1 1 605 607
Convolution              Conv_193                 1 1 607 608 0=64 1=1 5=1 6=4096
Swish                    Mul_195                  1 1 608 610
Convolution              Conv_196                 1 1 610 611 0=64 1=3 4=1 5=1 6=36864
Swish                    Mul_198                  1 1 611 613
Convolution              Conv_199                 1 1 604_splitncnn_0 614 0=64 1=1 5=1 6=10240
Swish                    Mul_201                  1 1 614 616
Concat                   Concat_202               2 1 613 616 617
Convolution              Conv_203                 1 1 617 618 0=128 1=1 5=1 6=16384
Swish                    Mul_205                  1 1 618 620
Split                    splitncnn_16             1 2 620 620_splitncnn_0 620_splitncnn_1
Convolution              Conv_206                 1 1 620_splitncnn_1 621 0=128 1=3 3=2 4=1 5=1 6=147456
Swish                    Mul_208                  1 1 621 623
Concat                   Concat_209               2 1 623 520_splitncnn_0 624
Split                    splitncnn_17             1 2 624 624_splitncnn_0 624_splitncnn_1
Convolution              Conv_210                 1 1 624_splitncnn_1 625 0=128 1=1 5=1 6=28672
Swish                    Mul_212                  1 1 625 627
Convolution              Conv_213                 1 1 627 628 0=128 1=1 5=1 6=16384
Swish                    Mul_215                  1 1 628 630
Convolution              Conv_216                 1 1 630 631 0=128 1=3 4=1 5=1 6=147456
Swish                    Mul_218                  1 1 631 633
Convolution              Conv_219                 1 1 624_splitncnn_0 634 0=128 1=1 5=1 6=28672
Swish                    Mul_221                  1 1 634 636
Concat                   Concat_222               2 1 633 636 637
Convolution              Conv_223                 1 1 637 638 0=256 1=1 5=1 6=65536
Swish                    Mul_225                  1 1 638 640
Split                    splitncnn_18             1 2 640 640_splitncnn_0 640_splitncnn_1
Convolution              Conv_226                 1 1 640_splitncnn_1 641 0=256 1=3 3=2 4=1 5=1 6=589824
Swish                    Mul_228                  1 1 641 643
Concat                   Concat_229               2 1 643 573_splitncnn_0 644
Split                    splitncnn_19             1 2 644 644_splitncnn_0 644_splitncnn_1
Convolution              Conv_230                 1 1 644_splitncnn_1 645 0=256 1=1 5=1 6=131072
Swish                    Mul_232                  1 1 645 647
Convolution              Conv_233                 1 1 647 648 0=256 1=1 5=1 6=65536
Swish                    Mul_235                  1 1 648 650
Convolution              Conv_236                 1 1 650 651 0=256 1=3 4=1 5=1 6=589824
Swish                    Mul_238                  1 1 651 653
Convolution              Conv_239                 1 1 644_splitncnn_0 654 0=256 1=1 5=1 6=131072
Swish                    Mul_241                  1 1 654 656
Concat                   Concat_242               2 1 653 656 657
Convolution              Conv_243                 1 1 657 658 0=512 1=1 5=1 6=262144
Swish                    Mul_245                  1 1 658 660
Convolution              Conv_246                 1 1 620_splitncnn_0 661 0=75 1=1 5=1 6=9600
Reshape                  Reshape_260              1 1 661 679 0=6400 1=25 2=3
Permute                  Transpose_261            1 1 679 output 0=1
Convolution              Conv_262                 1 1 640_splitncnn_0 681 0=75 1=1 5=1 6=19200
Reshape                  Reshape_276              1 1 681 699 0=1600 1=25 2=3
Permute                  Transpose_277            1 1 699 700 0=1
Convolution              Conv_278                 1 1 660 701 0=75 1=1 5=1 6=38400
Reshape                  Reshape_292              1 1 701 719 0=400 1=25 2=3
Permute                  Transpose_293            1 1 719 720 0=1
